lvchaqiu/meizu-mx-kernel/arch/arm/mach-exynos/include/mach/gpio-m030.h
/* linux/arch/arm/mach-exynos/include/mach/gpio-mx.h
 *
 * Copyright (C) 2011 Meizu Technology Co.Ltd, Zhuhai, China
 *
 * Author: lvcha qiu <lvcha@meizu.com>
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 
 *
 * Revision History
 *
 * Inital code : Jun 30 , 2011 : lvcha@meizu.com
 *
*/

#ifndef _MEIZUM030_GPIO_H
#define _MEIZUM030_GPIO_H

/* iNAND power enable pin */
#define M030_GPIO_INAND_EN			EXYNOS4_GPK0(2)

#define M030_GPIO_BUCK125_EN_A		EXYNOS4210_GPE2(0)
#define M030_GPIO_BUCK125_EN_B		EXYNOS4210_GPE2(3)
#define M030_GPIO_BUCK125_EN_C		EXYNOS4210_GPE1(1)

#define M030_GPIO_LED_SCL		EXYNOS4_GPF0(6)
#define M030_GPIO_LED_SDA	EXYNOS4_GPF2(0)

#define M030_GPIO_MHL_SCL	EXYNOS4_GPF2(4)
#define M030_GPIO_MHL_SDA	EXYNOS4_GPF2(2)

#define M030_GPIO_NFC_SCL	EXYNOS4_GPF3(5)
#define M030_GPIO_NFC_SDA	EXYNOS4_GPF3(3)

#define M030_GPIO_GP2A_SCL	EXYNOS4210_GPE2(4)
#define M030_GPIO_GP2A_SDA	EXYNOS4210_GPE2(1)

#define M030_GPIO_COMP_SCL	EXYNOS4210_GPE3(0)
#define M030_GPIO_COMP_SDA	EXYNOS4210_GPE3(6)

#define M030_GPIO_GSEN_SCL	EXYNOS4210_GPE4(1)
#define M030_GPIO_GSEN_SDA	EXYNOS4210_GPE3(7)

#define M030_GPIO_GYRO_SCL	EXYNOS4210_GPE4(5)
#define M030_GPIO_GYRO_SDA	EXYNOS4210_GPE3(3)

#define M030_GPIO_LED_0	EXYNOS4210_GPE4(4)
#define M030_GPIO_LED_1	EXYNOS4210_GPE0(0)
#define M030_GPIO_LED_2	EXYNOS4210_GPE0(1)
#define M030_GPIO_LED_3	EXYNOS4210_GPE0(2)
#define M030_GPIO_LED_4	EXYNOS4210_GPE0(3)
#define M030_GPIO_LED_5	EXYNOS4210_GPE0(4)

#define M030_GPIO_LED_PWM		EXYNOS4_GPD0(0)
#define M030_GPIO_MOTOR_PWM		EXYNOS4_GPD0(1)

#define M030_INT4_FUG			EXYNOS4_GPX0(4)
#define M030_INT5_PMU			EXYNOS4_GPX0(5)
#define M030_INT_TOUCH		EXYNOS4_GPX1(7)
#define M030_INT8_WIFI		EXYNOS4_GPX1(0)
#define M030_INT9_BT			EXYNOS4_GPX1(1)
#define M030_INT10_MHL		EXYNOS4_GPX1(2)
#define M030_INT11_BB_RESET 	EXYNOS4_GPX1(3)
#define M030_INT12_IPC_TRIG 	EXYNOS4_GPX1(4)
#define M030_INT14_IPC_WAKE 	EXYNOS4_GPX1(6)
#define M030_INT15_NFC 		EXYNOS4_GPX1(7)
#define M030_INT16_SIMDETECT	EXYNOS4_GPX2(0)
#define M030_INT17_HDETECT 	EXYNOS4_GPX2(1)
#define M030_INT18_GYRO 		EXYNOS4_GPX2(2)
#define M030_INT19_USB_MHL 	EXYNOS4_GPX2(3)
#define M030_INT20_GYRO_DATA EXYNOS4_GPX2(4)
#define M030_INT21_USB 		EXYNOS4_GPX2(5)

#define M030_GPIO_KEY_UP		EXYNOS4_GPX2(6)
#define M030_GPIO_KEY_BACK	EXYNOS4_GPX2(7)
#define M030_GPIO_KEY_DOWN	EXYNOS4_GPX3(0)
#define M030_GPIO_KEY_OFF	EXYNOS4_GPX3(1)
#define M030_GPIO_KEY_OK		EXYNOS4_GPX3(2)
#define M030_GPIO_KEY_HOME	EXYNOS4_GPX3(3)

#define M030_INT28_IR			EXYNOS4_GPX3(4)
#define M030_INT29_ACC		EXYNOS4_GPX3(5)
#define M030_INT31_HDMI_HPD	EXYNOS4_GPX3(7)

#define M030_GPIO_HDMI_CEC	EXYNOS4_GPX3(6)

#define M030_GPIO_LCD_RST	EXYNOS4_GPF0(0)
#define M030_GPIO_LCD_TE		EXYNOS4_GPF0(1)
#define M030_GPIO_LCD_EN		EXYNOS4210_GPE2(5)		/* 5.5V EN */
#define M030_GPIO_MIPI_EN		EXYNOS4_GPY6(3)		/* MIPI core 1.1V */
#define M030_GPIO_NFC_EN		EXYNOS4_GPF0(2)
#define M030_GPIO_NFC_GPIO4	EXYNOS4_GPF1(6)

#define M030_GPIO_CAMERA0_EINT EXYNOS4_GPF0(3)
#define M030_GPIO_CAMERA0_PDN  EXYNOS4_GPF0(7)
#define M030_GPIO_CAMERA0_RST  EXYNOS4_GPF1(2)

#define M030_GPIO_CAMERA1_PDN	EXYNOS4210_GPJ1(4)

#define M030_GPIO_CODEC_LDO1 EXYNOS4_GPF0(4)
#define M030_GPIO_CODEC_LDO2 EXYNOS4_GPF2(7)
#define M030_GPIO_CODEC_CRY EXYNOS4_GPF1(1)
#define M030_GPIO_SPDIF_EN EXYNOS4_GPL0(6)

#define M030_GPIO_NOISE_RST  EXYNOS4_GPF1(3)
#define M030_GPIO_NOISE_WAKE  EXYNOS4_GPF2(5)

#define M030_GPIO_SWITCH_SEL  EXYNOS4_GPF3(2)

#define M030_GPIO_LED_SYNC EXYNOS4_GPF1(7)
#define M030_GPIO_LED_RST EXYNOS4_GPF2(6)

#define M030_GPIO_MHL_WAKE EXYNOS4_GPF3(0)
#define M030_GPIO_MHL_RST EXYNOS4_GPF3(4)
#define M030_GPIO_MHL_EN0 EXYNOS4210_GPE2(2)	/*1.2V EN*/
#define M030_GPIO_MHL_EN1 EXYNOS4210_GPE3(1)	/*5.0V EN*/
#define M030_GPIO_MHL_EN3 EXYNOS4210_GPE3(2)	/*5.0V EN USB CHARGE DISABLE*/

#define M030_GPIO_HOST_ACTIVE EXYNOS4_GPL0(0)
#define M030_GPIO_SLAVE_WAKEUP EXYNOS4_GPL0(4)
#define M030_GPIO_REQUEST_SUSPEND EXYNOS4_GPX1(4)
#define M030_GPIO_HOST_WAKEUP EXYNOS4_GPX1(6)
#define M030_GPIO_MODEM_RESET_INT EXYNOS4_GPX1(3)
#define M030_GPIO_MODEM_DUMP_INT EXYNOS4_GPX1(5)

#define M030_GPIO_MODEM_ON EXYNOS4_GPL0(1)
#define M030_GPIO_MODEM_RST_FULL EXYNOS4_GPL0(2)
#define M030_GPIO_MODEM_RST EXYNOS4_GPL0(3)

#define M030_GPIO_HDMI_LV_EN EXYNOS4210_GPE1(3)
#define M030_GPIO_HDMI_PW_EN EXYNOS4210_GPE4(2)	/* 5.0V EN */

#define M030_GPIO_IO_NULL EXYNOS4210_GPE1(4)
#define M030_GPIO_TOUCH_RST EXYNOS4_GPY2(5)

#define M030_GPIO_HSIC_EN EXYNOS4_GPY6(4)	/*HSIC 1.2V*/
#define M030_GPIO_USB_PHY_EN EXYNOS4_GPY5(1)	/* Host 3.3V */
#define M030_GPIO_USB_CORE_EN EXYNOS4_GPY6(1) 	/*HOST 1.1V*/
#define M030_GPIO_VBUS_GPIO EXYNOS4_GPX0(2)

#define M030_GPIO_FACTORY_MODE 	EXYNOS4210_GPE1(2)
#define M030_GPIO_TEST_LED 		EXYNOS4210_GPE1(4)//CAMERA WIFI BT TEST LED

#endif	/*!_MEIZUM030_GPIO_H*/

